{
  "lang": "ru",
  "about": "Привет, я Front-end разработчик. Я прошел курс обучения в школе The Rolling Scopes. Это был нелегкий путь, но я справился и могу сказать, что это было круто. Выполнил много проектов и получил много знаний, познакомился с интересными людьми и профессионалами в области веб-разработки. Я попробовал себя в роли руководителя команды в командной разработке. Сейчас пришло время двигаться дальше, и я ищу компанию, которая позволит мне работать с интересным продуктом и полностью раскрыть свой потенциал. ",
  "about-full": "Привет, меня зовут Владимир и я front-end разработчик. Я прошел курс обучения в школе Rolling Scopes. Это был нелегкий путь, но я справился и могу сказать, что это было здорово. Выполнил много проектов и получил много знаний. За время учебы я познакомился с интересными людьми - профессионалами в области веб-разработки, а также выступил в роли руководителя команды из 3 человек во время финального задания курса JavaScript. За время обучения разработал множество пет-проектов, от чистых HTML, CSS и JavaScript лэндингов до SPA-приложений с использованием React, Typescript. Сейчас пришло время двигаться дальше, и я ищу компанию, которая позволит мне работать с интересным продуктом и полностью раскрыть свой потенциал. У меня больше года опыта в разработке веб-приложений (игры, лэндинги, SPA). Хорошее знание основ JavaScript позволяет мне быстро осваивать новые технологии и приносить пользу команде. Моя цель - совершенствовать свои навыки, чтобы разрабатывать качественный и востребованный продукт. ",
  "buttons": {
    "more": "подробнее",
    "close": "скрыть"
  },
  "not": "Такой страницы не существует. Пожалуйста нажмите ",
  "here": "сюда",
  "contacts": "контакты",
  "pages": "страницы",
  "skills": "навыки",
  "summary": "описание",
  "stack": "Стэк: ",
  "work-title": "Реализовано: ",
  "projects": "проекты",
  "projects-data": {
    "tracker": {
      "descr": "Аналог приложения Trello (командная разработка)",
      "work": "регистрация, авторизация, профиль, локализация(i18next), переиспользуемый компонент формы, меню бургер, шапка, стилизация проекта(material Ui), развертывание приложения и бэкенда."
    },
    "rick": {
      "descr": "SPA на основе открытого API",
      "work": "API запросы, получение данных для создания карточек, создание карточек пользователем, поиск по фильтрам и параметрам, поиск по странице, маршрутизация, пагинация, тестирование компонентов (RTL, Jest)"
    },
    "todo": {
      "descr": "Планировщик задач",
      "work": "перетаскивание, анимация перетаскивания задачи, просмотр полной задачи в модальном окне, прокрутка выполненных задач, редактирование задачи, сохранение задачи в локальном хранилище, просмотр на экране от 320 пикселей"
    },
    "keyboard": {
      "descr": "Виртуальная клавиатура",
      "work": "обработка нажатий клавиш на клавиатуре, взаимодействие клавиатуры и мыши, изменение языка, localStorage, webpack. Вся генерация HTML происходит  в скрипте приложения, HTML файл пустой."
    },
    "store": {
      "descr": "Виртуальный магазина",
      "work": "строка поиска, несколько вариантов сортировки: название, год, цвет, память, количество, популярные, добавление и удаление из корзины, сброс параметров поиска, сброс настроек localstore, данные сохраняются в localstore. Минимальное разрешение приложения - 768 пикселей. Вся генерация HTML происходит в скрипте приложения, HTML файл пустой."
    },
    "shelter": {
      "descr": "Сайт приюта домашних животных",
      "work": "бургер меню, кастомный слайдер, попап с дополнительной иформацией о карточке, пагинация, мобильная версия, отслеживая позиций и размера  экрана."
    },
    "photo": {
      "descr": "Сайт фотографа",
      "work": "бургер меню,темная / светлая тема, кастомная локализация, загрузка карточек по категориям , мобильная версия."
    },
    "cv": {
      "descr": "Портфолио",
      "work": "бургер меню, навигация  по странице, получение и сохранение данных в state, сохранение данных о дейсвиях в LocalStorage(смена языка, выбор категории карточек),отрисовка карточек, модальное окно, локализация, маршрутизация, бесконечная карусель, страница 404, просмотр сайта с разрешения 320 пикселей (мобильная версия)"
    },
    "products": {
        "descr": "Страница продуктов",
        "work": "Material UI (отрисовка карточек, списков, кнопок), список всех товаров,отображение списка выбранных товаров на всех страницах, переход на страницу товара, возможность просмотра увеличенного изображения продукта, получение и сохранение данных в state, сохранение данных о дейсвиях в LocalStorage(избранные товары),отрисовка карточек, локализация, маршрутизация, просмотр сайта с разрешения 1920 пикселей "
      },
    "books-store": {
        "descr": "Книжный магазин",
        "work": "Список товаров, навигация по страницам, просмотр полной информации о товаре, удаление товара, изменение цены, все данные приходят с сервера. (Возможна задерка ответа сервера при первом запуске приложения)"
      },
    "google-clone": {
        "descr": "Клон поисковика Google",
        "work": "основная форма поиска на главной странице, шапка с формой поиска на страницач с результатом поиска,страница результатов поиска, страница результатов поиска изображений, пагинация, обновление метаданных, api вызовы, компонент карточки с результата поиска(текст / ссылки / изображения ), маршрутизация, компонент загрузки, компонент 'нет результата поиска', компонент ошибки, просмотр сайта с разрешением 320 пикселей (мобильная версия),"
        }

  }
}
